###############################################################
#  Generated by:      Cadence Innovus 25.11-s102_1
#  OS:                Linux x86_64(Host ID ece-rschsrv.ece.gatech.edu)
#  Generated on:      Sat Feb 14 12:56:50 2026
#  Design:            counter_16bit
#  Command:           write_design -tempus dbs/postroute
###############################################################

#dataVar is dir where this script is found
set dataVar [file dirname [file normalize [info script]]]

set_db init_ground_nets {VSS}
set_db init_lef_files {/nethome/dkhalil8/InnovateECE/RTL2GDS/design/dbs/route.enc_3/libs/lef/sky130_scl_9T.tlef /nethome/dkhalil8/InnovateECE/RTL2GDS/design/dbs/route.enc_3/libs/lef/sky130_scl_9T.lef /nethome/dkhalil8/InnovateECE/RTL2GDS/design/dbs/route.enc_3/libs/lef/sky130_sram_2kbyte_1rw1r_32x512_8.lef}
set_db init_power_nets {VDD}
set_db init_read_netlist_files {/nethome/dkhalil8/InnovateECE/RTL2GDS/design/dbs/syn_opt.cdb_2/cmn/counter_16bit.v.gz}
set_db read_physical_allow_multiple_port_pin_without_must_join true
set_db timing_time_unit {1ns}
set_db timing_cap_unit {1.0pf}

read_mmmc $dataVar/counter_16bit.mmmc.tcl

read_physical -lefs {/nethome/dkhalil8/InnovateECE/RTL2GDS/design/dbs/route.enc_3/libs/lef/sky130_scl_9T.tlef /nethome/dkhalil8/InnovateECE/RTL2GDS/design/dbs/route.enc_3/libs/lef/sky130_scl_9T.lef /nethome/dkhalil8/InnovateECE/RTL2GDS/design/dbs/route.enc_3/libs/lef/sky130_sram_2kbyte_1rw1r_32x512_8.lef}

read_netlist $dataVar/counter_16bit.v.gz

init_design

